In [1]:
# grouping on TS Data

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sn

In [5]:
df = pd.read_excel("https://github.com/chris1610/pbpython/blob/master/data/sample-salesv3.xlsx?raw=True")
df.head()

,account number,name,sku,quantity,unit price,ext price,date
0,740150,Barton LLC,B1-20000,39,86.69,3380.91,2014-01-01 07:21:51
1,714466,Trantow-Barrows,S2-77896,-1,63.16,-63.16,2014-01-01 10:00:47
2,218895,Kulas Inc,B1-69924,23,90.70,2086.10,2014-01-01 13:24:58
3,307599,"Kassulke, Ondricka and Metz",S1-65481,41,21.05,863.05,2014-01-01 15:05:22
4,412290,Jerde-Hilpert,S2-34077,6,83.21,499.26,2014-01-01 23:26:55

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   account number  1500 non-null   int64
 1   name            1500 non-null   object
 2   sku             1500 non-null   object
 3   quantity        1500 non-null   int64
 4   unit price      1500 non-null   float64
 5   ext price       1500 non-null   float64
 6   date            1500 non-null   object
dtypes: float64(2), int64(2), object(3)
memory usage: 82.2+ KB

In [7]:
df['date'] = pd.to_datetime(df['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   account number  1500 non-null   int64
 1   name            1500 non-null   object
 2   sku             1500 non-null   object
 3   quantity        1500 non-null   int64
 4   unit price      1500 non-null   float64
 5   ext price       1500 non-null   float64
 6   date            1500 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 82.2+ KB

In [8]:
df.head()

,account number,name,sku,quantity,unit price,ext price,date
0,740150,Barton LLC,B1-20000,39,86.69,3380.91,2014-01-01 07:21:51
1,714466,Trantow-Barrows,S2-77896,-1,63.16,-63.16,2014-01-01 10:00:47
2,218895,Kulas Inc,B1-69924,23,90.70,2086.10,2014-01-01 13:24:58
3,307599,"Kassulke, Ondricka and Metz",S1-65481,41,21.05,863.05,2014-01-01 15:05:22
4,412290,Jerde-Hilpert,S2-34077,6,83.21,499.26,2014-01-01 23:26:55

In [10]:
df1= df.set_index('date')
#column to index
df1.head()

,account number,name,sku,quantity,unit price,ext price
date,,,,,,
2014-01-01 07:21:51,740150,Barton LLC,B1-20000,39,86.69,3380.91
2014-01-01 10:00:47,714466,Trantow-Barrows,S2-77896,-1,63.16,-63.16
2014-01-01 13:24:58,218895,Kulas Inc,B1-69924,23,90.70,2086.10
2014-01-01 15:05:22,307599,"Kassulke, Ondricka and Metz",S1-65481,41,21.05,863.05
2014-01-01 23:26:55,412290,Jerde-Hilpert,S2-34077,6,83.21,499.26

In [11]:
df1.shape

(1500, 6)

In [13]:
df1.resample('M')['ext price'].sum()
#works only on index' with 1 column values

date
2014-01-31    185361.66
2014-02-28    146211.62
2014-03-31    203921.38
2014-04-30    174574.11
2014-05-31    165418.55
2014-06-30    174089.33
2014-07-31    191662.11
2014-08-31    153778.59
2014-09-30    168443.17
2014-10-31    171495.32
2014-11-30    119961.22
2014-12-31    163867.26
Freq: M, Name: ext price, dtype: float64

In [14]:
df1.groupby('name')['ext price'].resample('M').sum()
#gp by customer & month sales  : clumsy

name        date
Barton LLC  2014-01-31     6177.57
            2014-02-28    12218.03
            2014-03-31     3513.53
            2014-04-30    11474.20
            2014-05-31    10220.17
                            ...
Will LLC    2014-08-31     1439.82
            2014-09-30     4345.99
            2014-10-31     7085.33
            2014-11-30     3210.44
            2014-12-31    12561.21
Name: ext price, Length: 240, dtype: float64

In [16]:
# standard way of grouping 
df.groupby(['name', pd.Grouper(key='date', freq='M')])['ext price'].sum()

name        date
Barton LLC  2014-01-31     6177.57
            2014-02-28    12218.03
            2014-03-31     3513.53
            2014-04-30    11474.20
            2014-05-31    10220.17
                            ...
Will LLC    2014-08-31     1439.82
            2014-09-30     4345.99
            2014-10-31     7085.33
            2014-11-30     3210.44
            2014-12-31    12561.21
Name: ext price, Length: 240, dtype: float64

In [19]:
# annual summary group on particular month
df.groupby(['name', pd.Grouper(key='date', freq='A-SEP')])['ext price'].sum()

name                             date
Barton LLC                       2014-09-30     92412.78
                                 2015-09-30     17025.72
Cronin, Oberbrunner and Spencer  2014-09-30     66748.47
                                 2015-09-30     22986.08
Frami, Hills and Schmidt         2014-09-30     71576.32
                                 2015-09-30     31993.27
Fritsch, Russel and Anderson     2014-09-30     82949.81
                                 2015-09-30     29264.90
Halvorson, Crona and Champlin    2014-09-30     57768.44
                                 2015-09-30     12235.92
Herman LLC                       2014-09-30     67879.72
                                 2015-09-30     14985.28
Jerde-Hilpert                    2014-09-30     87119.78
                                 2015-09-30     25471.65
Kassulke, Ondricka and Metz      2014-09-30     63061.59
                                 2015-09-30     23389.48
Keeling LLC                      2014-09-30     76457.33
                                 2015-09-30     24476.97
Kiehn-Spinka                     2014-09-30     74917.80
                                 2015-09-30     24690.97
Koepp Ltd                        2014-09-30     78189.47
                                 2015-09-30     25471.07
Kuhn-Gusikowski                  2014-09-30     68376.77
                                 2015-09-30     22717.51
Kulas Inc                        2014-09-30    111341.96
                                 2015-09-30     26010.00
Pollich LLC                      2014-09-30     62035.05
                                 2015-09-30     25312.13
Purdy-Kunde                      2014-09-30     60971.13
                                 2015-09-30     16927.08
Sanford and Sons                 2014-09-30     88138.72
                                 2015-09-30     10684.26
Stokes LLC                       2014-09-30     73698.38
                                 2015-09-30     17837.54
Trantow-Barrows                  2014-09-30     96642.78
                                 2015-09-30     26738.60
White-Trantow                    2014-09-30    101593.60
                                 2015-09-30     34248.39
Will LLC                         2014-09-30     81580.62
                                 2015-09-30     22856.98
Name: ext price, dtype: float64

In [20]:
# annual summary by Academic Year - JUL
df.groupby(['name', pd.Grouper(key='date', freq='A-JUL')])['ext price'].sum()

name                             date
Barton LLC                       2014-07-31    60817.71
                                 2015-07-31    48620.79
Cronin, Oberbrunner and Spencer  2014-07-31    48655.15
                                 2015-07-31    41079.40
Frami, Hills and Schmidt         2014-07-31    55138.36
                                 2015-07-31    48431.23
Fritsch, Russel and Anderson     2014-07-31    71530.94
                                 2015-07-31    40683.77
Halvorson, Crona and Champlin    2014-07-31    48626.71
                                 2015-07-31    21377.65
Herman LLC                       2014-07-31    45610.54
                                 2015-07-31    37254.46
Jerde-Hilpert                    2014-07-31    69609.39
                                 2015-07-31    42982.04
Kassulke, Ondricka and Metz      2014-07-31    43228.92
                                 2015-07-31    43222.15
Keeling LLC                      2014-07-31    71627.52
                                 2015-07-31    29306.78
Kiehn-Spinka                     2014-07-31    58999.08
                                 2015-07-31    40609.69
Koepp Ltd                        2014-07-31    58186.44
                                 2015-07-31    45474.10
Kuhn-Gusikowski                  2014-07-31    57713.30
                                 2015-07-31    33380.98
Kulas Inc                        2014-07-31    89925.72
                                 2015-07-31    47426.24
Pollich LLC                      2014-07-31    51858.07
                                 2015-07-31    35489.11
Purdy-Kunde                      2014-07-31    46468.50
                                 2015-07-31    31429.71
Sanford and Sons                 2014-07-31    67779.61
                                 2015-07-31    31043.37
Stokes LLC                       2014-07-31    63278.11
                                 2015-07-31    28257.81
Trantow-Barrows                  2014-07-31    72398.65
                                 2015-07-31    50982.73
White-Trantow                    2014-07-31    83991.23
                                 2015-07-31    51850.76
Will LLC                         2014-07-31    75794.81
                                 2015-07-31    28642.79
Name: ext price, dtype: float64

# Group Aggregating
- https://pbpython.com/pandas-grouper-agg.html

In [21]:
df[["ext price", "quantity", "unit price"]].agg(['sum', 'mean'])

         ext price      quantity    unit price
sum   2.018784e+06  36463.000000  82511.290000
mean  1.345856e+03     24.308667     55.007527

In [22]:
# Dictionary Method
df.agg({'ext price': ['sum', 'mean'], 'quantity': ['sum', 'mean'], 'unit price': ['mean']})

         ext price      quantity  unit price
sum   2.018784e+06  36463.000000         NaN
mean  1.345856e+03     24.308667   55.007527

In [23]:
# max 
get_max = lambda x: x.value_counts(dropna=False).index[0]

In [24]:
df.agg({'ext price': ['sum', 'mean'], 'quantity': ['sum', 'mean'], 'unit price': ['mean'], 'sku': [get_max]})

             ext price      quantity  unit price       sku
sum       2.018784e+06  36463.000000         NaN       NaN
mean      1.345856e+03     24.308667   55.007527       NaN
<lambda>           NaN           NaN         NaN  S2-77896

In [25]:
get_max.__name__ = "most frequent"  #rename output

In [26]:
df.agg({'ext price': ['sum', 'mean'], 'quantity': ['sum', 'mean'], 'unit price': ['mean'], 'sku': [get_max]})

                  ext price      quantity  unit price       sku
sum            2.018784e+06  36463.000000         NaN       NaN
mean           1.345856e+03     24.308667   55.007527       NaN
most frequent           NaN           NaN         NaN  S2-77896

In [27]:
# without an order
import collections
f = collections.OrderedDict([('ext price', ['sum', 'mean']), ('quantity', ['sum', 'mean']), ('sku', [get_max])])
df.agg(f)

                  ext price      quantity       sku
sum            2.018784e+06  36463.000000       NaN
mean           1.345856e+03     24.308667       NaN
most frequent           NaN           NaN  S2-77896